# Pandas Library

#### Explore pandas lib from scratch

In [1]:
import pandas as pd;

### Read Dataset from local device

In [ ]:
df=pd.read_csv('car_prices.csv') # we can read json, html, xlsx file with the help of pandas
print(f"First five Data:\n{df.head()}")
print(f"\nLast five Data:\n{df.tail()}")

### Custome Dataset and save in local device

In [ ]:
person={
    "personName":["basit","ali","muhammad"],
    "age":[23,44,19],
    "gender":["male","male","male"],
    "weight":[70.3,70,'2']
}

person=pd.DataFrame(person)

person.to_json("output.json",index=False)

## Info and descript Method

In [13]:
# print("Infor of Dataset:",df.info()) # information about the whole dataset

data={
    "name":["shahid","basit","zeeshan","kumail","askari","siraj","shukoor","kazim","muhammad","sakina","khatija","kubra"],
    "age":[23,24,25,20,11,23,46,78,64,30,26,28],
    "salary":[3873,9472,2904,2890,4232,3211,2222,4562,1234,3421,1235,7632],
    "performance Score":[85,23,45,90,14,45,67,78,90,33,66,88],

}

sampledf=pd.DataFrame(data)
print("Sample DataFram:\n",sampledf)

print("Descriptive Statistics:")
print("\n",sampledf.describe())

Sample DataFram:
         name  age  salary  performance Score
0     shahid   23    3873                 85
1      basit   24    9472                 23
2    zeeshan   25    2904                 45
3     kumail   20    2890                 90
4     askari   11    4232                 14
5      siraj   23    3211                 45
6    shukoor   46    2222                 67
7      kazim   78    4562                 78
8   muhammad   64    1234                 90
9     sakina   30    3421                 33
10   khatija   26    1235                 66
11     kubra   28    7632                 88
Descriptive Statistics:

              age       salary  performance Score
count  12.000000    12.000000          12.000000
mean   33.166667  3907.333333          60.333333
std    19.622961  2435.818001          27.436980
min    11.000000  1234.000000          14.000000
25%    23.000000  2723.000000          42.000000
50%    25.500000  3316.000000          66.500000
75%    34.000000  4314.500000          85.750000
max    78.000000  9472.000000          90.000000

## Shape and column

In [4]:
print("Shape of dataframe",sampledf.shape)
print("Column of Dataset:",sampledf.columns)

Shape of dataframe (4, 4)
Column of Dataset: Index(['name', 'age', 'salary', 'performance Score'], dtype='object')

## Filter and selecting

In [23]:
# Select single  Column

selectAge=sampledf["age"]
print("Select single Column in Dataset\n",selectAge)

selectMultipleColumn=sampledf[["age","name","performance Score"]]
selectMultipleColumn

Select single Column in Dataset
 0     23
1     24
2     25
3     20
4     11
5     23
6     46
7     78
8     64
9     30
10    26
11    28
Name: age, dtype: int64

    age      name  performance Score
0    23    shahid                 85
1    24     basit                 23
2    25   zeeshan                 45
3    20    kumail                 90
4    11    askari                 14
5    23     siraj                 45
6    46   shukoor                 67
7    78     kazim                 78
8    64  muhammad                 90
9    30    sakina                 33
10   26   khatija                 66
11   28     kubra                 88